Revit 2027 API
FamilySizeTable.IsValidColumnIndex Method
 Checks if the column index is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidColumnIndex(
	int index
)
Public Function IsValidColumnIndex (
	index As Integer
) As Boolean
public:
bool IsValidColumnIndex(
	int index
)
member IsValidColumnIndex :
        index : int -> bool
Parameters
index Int32
 The index of the column.
Return Value
Boolean
 True if the column index is valid, false otherwise.
See Also
Reference
FamilySizeTable Class
Autodesk.Revit.DB Namespace